[
  {
    "id": "1f94c1dc-ed5b-80ca-9d13-d2698daec8a4",
    "title": "The Ultimate Guide to B2B Data",
    "created_time": "2025-05-20T14:07:00.000Z",
    "last_edited_time": "2025-05-20T14:08:00.000Z",
    "content": "Business-to-business (B2B) data is information about other businesses, including company identification, funding and financial data, organization and management changes, product information, and other business-relevant data. It’s used to enhance marketing and sales strategies. It’s essential for businesses because understanding how to collect, manage, and use this data improves decision-making and aids marketing, growth, and sales teams in implementing effective strategies.\nThis guide will expose you to various types of B2B data, key use cases, and methods to gather this data (web scraping and datasets). It will also emphasize how your business can use this data to fuel their growth strategies.\nTypes of B2B Data\nB2B data is categorized into two groups: internal data, generated within a business (e.g. transaction, operation, and customer interaction data**),** and external data, data sourced from third-party sources or public information about other companies. In this guide, we focus on the external data. Let’s explore various types of this data:\n• Firmographics: This is high-level data about companies such as the name, size, funding, headcount, hiring activities,  location, industry, and revenue. Companies use it to identify potential clients that fit specific industries, and market research.\n• Technographics: This data provides insights into the technologies other companies use, including the technology stacks of their employees. It’s used for competitive analysis and sales targeting by tech-related companies.\n• People and Contact Data: You can also think of it as demographic data. It’s essentially data about people. Data such as name, phone contact, email, work history, location, skills and more. Sales and marketing teams use this data for lead generation and building contact lists.\n• Intent data: This data signals when a company is interested in particular products based on web activity, engagement, or digital behaviors. It’s a step up from chronographic data (information relating to events and changes in companies) because it’s more targeted and easier to act on for marketing teams.\nHow to Collect B2B Data\nNow that you understand the importance of B2B data, let’s explore how to collect it. The two primary methods for gathering external B2B data are web scraping and pre-collected datasets. Each approach has its strengths and limitations, we’ll examine them in detail in the following sections.\nWeb Scraping\nWeb scraping lets you use automated tools to grab public information from public websites. Scraping data from publicly available websites is one of the most efficient ways to gather real-time B2B information, such as competitor updates, job postings, and customer feedback.  While web scraping is often seen as a gray area, It is legal as long as you comply with the CCPA and GDPR, do not collect data behind a login wall or that is not publicly available, and avoid personally identifiable information, you are fine.\nTo get started with web scraping, you’ll need the right tools. Python provides a rich library ecosystem and the perfect language for this with libraries like requests for sending HTTP requests, beautifulsoup for parsing HTML and XML, and selenium for automating interactions with web browsers. While we won’t cover the technical details of building a scraper here, you can follow this tutorial from Bright Data.\nMoreover, most companies work to prevent data scraping by implementing measures like IP bans, geo-restrictions, rate limits, and CAPTCHA challenges. For instance, in 2023, X (formerly Twitter) banned any kind of scraping or crawling without “prior written consent.”  In this case, a basic web scraper tool won’t suffice, you need a web scraper tool that provides sophisticated web scraping APIs, tools, and proxy servers. A proxy server acts as an intermediary between your computer and the target webpages. It’s like an invisibility cloak that allows the web scraper to bypass rate-limiting systems, location restrictions, and more. Bright Data provides a proxy-checking tool that tests and verifies the functionality and quality of proxies in a list, assessing factors like risk, geolocation, and type.\nWeb scraping is just one method of data collection; next, we’ll explore the alternative—pre-collected datasets.\nDatasets\nWeb scraping for b2b data requires a significant effort in setting up data infrastructure, investing in software development teams, and maintenance. Businesses that don’t have the resources for this make use of predefined b2b datasets. Datasets are collections of data, often in tabular form such as a CSV or Excel file, focused on a specific topic or analysis.  Purchasing a dataset can be faster and more cost-effective, especially for businesses needing to prototype quickly or lacking the technical expertise to manage in-house data collection.\nHowever, low-quality datasets can be costly. Gartner (a tech research and consulting firm) estimates that poor data quality costs organizations an average of $15 million per year. Also, a global data quality report in 2015 reports that organizations believe that 27% of their revenue is wasted due to inaccurate and incomplete customer or prospect data. To avoid this, it’s essential to choose reliable providers with a track record of quality. We recommend Bright Data Datasets. Bright Data ensures that each dataset undergoes rigorous quality assurance processes to ensure accuracy, reliability, and relevance. Additionally, they continuously update and refresh the datasets to reflect the latest information, ensuring that users always have access to the most current data.\nNow you know how to collect B2B data, let’s explore the differences between building a custom web scraping tool and purchasing prebuilt datasets.\nWeb Scraping vs Pre-built Datasets\nIn the last section, we established that when it comes to collecting B2B data, businesses can either build their own web scraping infrastructure or rely on pre-built datasets. Each approach has its pros and cons, which should be weighed based on your business’s resources, timeline, and data needs.\nCollecting B2B Data Yourself\nBuilding in-house web scraping infrastructure gives you full control of your data collection process. You have complete ownership.\nPros\n• You can tweak the scraping process to capture exactly the data you need, from specific sources, and at your preferred frequency.\n• As your business grows and evolve, you have direct control over your scraping setup which allows you to adjust according to business needs.\n• Long-term cost savings:  While setup costs are high, in-house infrastructure becomes more cost-effective over time, especially for businesses with ongoing data needs.\nCons\n• Building web scraping infrastructure requires significant time, technical expertise, and financial investment due to hiring specialized developers, setting up proxies, and ensuring compliance with legal guidelines.\n• Websites are constantly changing their structures and anti-scraping measures, so you'll need to regularly update your scraper to ensure it continues to function properly.\nOutsourcing B2B Data with Pre-Built Datasets\nPurchasing pre-built datasets offers a fast solution for companies needing reliable data without the overhead of building infrastructure.\nPros\n• Providers like Bright Data offers pre-processed, ready-to-use datasets, allowing you to start data-driven initiatives without delay. Also, you get access to a diverse and extensive range of B2B data that might be difficult, if not impossible, to gather independently. For instance, the Linkedin, Crunchbase, Indeed datasets, and more.\n• There’s no need to worry about updating or maintaining a scraping setup. The provider handles all infrastructure, data collection, and updates.\n• Cost Efficiencies: Using pre-built datasets can save time and expenses, particularly for short-term or initial data needs.\nCons\n• The accuracy and freshness of the data depend entirely on the provider’s quality standards and update schedules.\n• You’re limited to the data provided by the third-party source, which might not always align perfectly with your specific needs.\nNow that you’ve decided on a solution for collecting data, let’s explore how to leverage B2B data effectively.\nHow to Leverage B2B Data\nThe next step after gathering B2B data is to strategically use it to drive business growth. In this section, we’ll outline ways companies leverage B2B data to maximize impact.\nLead Generation and ICP Targeting\nB2B data is invaluable for refining lead generation and targeting Ideal Customer Profiles (ICPs). Sales experts use it to enhance strategies, boost lead generation, and increase conversion rates. For example, a new web app hosting company can leverage technographic data to identify potential customers currently using complementary technologies that would benefit from their software solutions.\nCompetitive Analysis\nIf your company operates in the talent acquisition or human resources industry, analyzing review data from sources like Glassdoor will reveal employee sentiment and highlight potential red flags in competing companies. B2B data enables businesses to monitor data points such as competitors' technology stacks, locations, employee count, and product purchases. This helps anticipate competitors' moves and identify potential areas for growth or disruption.\nAccount-Based Marketing\nAccount Based Marketing (ABM) is a B2B marketing approach that focuses on specific accounts and their contacts.  With demographic data on organizational structure, contact information, and decision-makers within targeted companies, sales and marketing teams can craft personalized strategies that resonate with the key targets, consequently, increasing the likelihood of engagement and conversion.\nRisk and Market Analysis\nB2B data provides insight into potential risks and challenges, such as regulatory changes, economic shifts, or technological disruptions. Data points like company acquisitions, expansions, funding rounds, and changes in top management will signal potential shifts in the ecosystem. Businesses use this information to make informed decisions about investments, partnerships, and market entry strategies.\nThese are just some common applications of B2B data. To see how companies successfully use B2B data, explore customer stories from Bright Data for inspiration.\nConclusion\nIn this guide, you’ve learned how B2B data is an indispensable asset for optimizing sales and marketing strategies. B2B data types such as Firmographic, demographic, technographic, and intent data, enable companies to refine lead generation strategies, enhance competitive analysis, and drive operational efficiency.\nWhether through building a custom web scraping solution or using pre-collected datasets, B2B data offers businesses the insights needed to stay competitive in an evolving marketplace.\nAs a trusted provider of web data solutions, Bright Data offers a range of ready-to-use B2B datasets from sources like LinkedIn, Glassdoor, and Crunchbase. With access to accurate and up-to-date data, your business can equip itself with the insights necessary to make informed decisions, seize growth opportunities, and maintain an edge over competitors."
  },
  {
    "id": "1f94c1dc-ed5b-8047-a487-d27e4759753b",
    "title": "Feature Toggling with ReBac using Permit.io and CASL",
    "created_time": "2025-05-20T14:07:00.000Z",
    "last_edited_time": "2025-05-20T14:07:00.000Z",
    "content": "\nCode Deliverables\nGitHub - Umoren/document-manager\nIntroduction\nIf you’re a developer working on a front-end app, you probably need to show or hide features based on who’s logged in. That’s called Feature Toggling.\nWhen users have different access levels, we need to make sure that they only see relevant features and sometimes even control what they can do with those features. Unlike traditional role-based permissions, ReBAC provides fine-grained control by extending permissions across related resources and users, enabling dynamic feature toggles that adapt in real-time based on relationship change.\nIn this tutorial, we’ll learn how to set up feature toggling with Relationship-based Access Control (ReBAC) using Permit.io and CASL (a popular isomorphic JavaScript authorization library).\nWe’ll build a basic document management app that restricts access to features like creating, editing, and viewing documents based on user relationships, such as being a Document Owner or having Category Access.\nBuilding ReBAC Policies with Permit.io and CASL\nIn a Relationship-Based Access Control (ReBAC) system, permissions are assigned based on relationships between users and resources, not just predefined roles. This allows for dynamic access to features, where different users may interact with the same resource differently based on their relationship with it. The core of our implementation involves defining policies that manage these relationships and control feature toggling. Learn more about building ReBAC policies from the docs.\nWhat we’ll build\nReBAC policies differ from traditional role-based systems because they focus on user-to-resource relationships rather than static roles. In a traditional Role-Based Access Control (RBAC) system, permissions are rigidly defined around a user’s role, such as “Editor” or “Viewer.” However, in ReBAC, we dynamically control access based on the specific relationship a user has to a resource instance, such as a document or category.\nIn this project, we will build a document management app that dynamically displays documents based on user resource roles and permissions.\nPrerequisite\nWhile this isn't a step-by-step tutorial focused on implementation detail, every code snippet is derived from the demo project. If you'd like to follow along or explore the code in more depth,  make sure you have the following prerequisites in place:\n• An account with Permit\n• A properly configured PDP (Policy Decision Point) with the correct API Key\n• Clone the demo app GitHub repository\nModeling ReBAC Policies\nLet’s get started by defining resources\nDefining Resources\nFor this document manager app, we will create two resources: Category and Document. Think of a category as a folder and document as files in the folder. For instance, finance is a category and expense_budget and salary_expenses are documents in the finance category.\nNext, we define actions that a user can act on the Category and Document resources.\nFor Category:\n• list-documents, create-document, delete, and rename\nFor Document:\n• comment, edit, delete, read\nDefining Resource Roles\nA resource role denotes the set of permissions that can be granted on instances of a particular resource. In our case, Category resource will have Editor, Admin and Viewer roles.\nWhile the document resource will have Editor and Viewer roles.\nDefine Permissions\nHere, we assign what action a resource role (e.g Category#Editor) is permitted to do.\nA Category#Admin in our case has the permission to:\n• create-document\n• delete\n• list-documents\n• rename\nA Document#Editor has permission to:\n• comment\n• edit\n• read\n• but no permission to delete\nDefine Relation\nIn Permit, a relation is a type of relationship Tuple. In our case, we have just one relation. Category is a parent of Document. Learn more about Relationship Tuples here\nDefine Role Derivation\nIn ReBAC, role derivation lets users gain permissions without needing a direct role assignment for each instance. When a user is assigned a role in a category (like Category#Editor), they automatically gain corresponding permissions on all documents within that category through role derivation. This means we don't need separate permission checks for documents - the relationship between category and documents handles this automatically.\nFor example, a Category#Editor will be a Document#Editor for all documents in that category due to our 'parent' relationship.\nSame with a Category#Viewer.\nIt’s important to note that this derivation is based on the relation. For instance, a Document#Editor can not be a Category#Editor.\nThis is what our model looks like so far.\nDefine Resource Instances and Relationship Tuples\nLet’s go ahead and define some resource instances. As the name implies, a resource instance is a specific occurrence or version of a resource. In our case, we create finance and hr as resource instances of Category. Then budget_report, marketing_expense, and salary_report are resource instances of Document.\nNow let’s define relationships between these instances. As defined, the finance category has access to budget_report and marketing_expense documents. This is cool because the resource role derivation and relations has established this connection.\nThe hr category has access to the salary_report document\nAssigning User to Resource Instance\nNote: You can do all these operations programmatically using Permit API endpoints. See the ReBAC API calls reference here.\nTo assign a user to a resource instance, you must pass the userId, role, tenant, and resource_instance to the roleAssignments endpoint.\n\n// Assign user as editor of a category\nawait permit.api.roleAssignments.assign({\n    user: userId,\n    role: \"Editor\",  // Becomes Category#Editor\n    tenant: \"default\",\n    resource_instance: `Category:${categoryId}`\n});\n\nHere’s an example\nThis admin user has instance access to all categories and documents in the app.\nAt this point, your ReBAC system is ready.\nHowever, the goal of this guide is to use this to implement feature toggling. So our next step is to write some API endpoints that use permit.check to determine if a user can perform certain actions or have access to resources.\nSetting up Local PDP and Initializing Permit SDK\nIn a ReBAC system, policies can become highly dynamic and context-sensitive, relying on various attributes, roles, and relationships between users and resources.\nTo evaluate these policies effectively, a Policy Decision Point (PDP) is required. The PDP is responsible for making real-time decisions on whether a user is allowed to perform certain actions on a resource based on the relationships and rules defined within the access control system.\nFor this project, we use a Local PDP to handle the more complex ReBAC policies. While Permit.io offers a Cloud PDP, it has certain limitations when handling advanced policies like ReBAC, particularly due to its focus on RBAC and the 1MB data restriction. To avoid these restrictions and support ReBAC policies, we need to deploy a Local PDP that can process more intricate relationship-based logic.\nYou can follow Permit.io's official documentation to set up your Local PDP using Docker. Below is a screenshot showing the steps to pull and run the PDP container:\nOnce the PDP container is running, it will listen on port 7766 and will handle incoming requests for permission checks. The PDP container communicates with Permit.io's API and processes the ReBAC policies that define access control based on user-resource relationships.\nNext, in our project, we connect the backend to this PDP. This is done in the permitInstance.js file where the Permit.io SDK is initialized:\n\nrequire('dotenv').config({ path: \".env\" });\nconst { Permit } = require(\"permitio\");\n\nconst permit = new Permit({\n    token: process.env.PERMIT_TOKEN,\n    pdp: \"<http://localhost:7766>\",\n    debug: true,\n    log: {\n        level: \"debug\"\n    }\n});\n\nmodule.exports = permit;\n\n\nThis setup ensures that any permission checks made through the backend will now be processed by the local PDP.\nCreating API endpoints to handle permission checks\nAs a result of role derivations, we only need to check category permissions - document permissions are automatically derived based on the relationship between categories and documents. Here's our category endpoint:\n\nrouter.get('/', async (req, res) => {\n    try {\n        const userId = req.headers['user-id'];\n\n        const accessibleCategories = await Promise.all(\n            Object.values(categories).map(async (category) => {\n                const canAccess = await permit.check(userId, \"list-documents\", `Category:${category.id}`);\n                if (!canAccess) return null;\n\n                // Add document count\n                const categoryDocuments = Object.values(documents)\n                    .filter(doc => doc.categoryId === category.id);\n\n                return {\n                    ...category,\n                    documentCount: categoryDocuments.length\n                };\n            })\n        );\n\n        res.json(accessibleCategories.filter(Boolean));\n    } catch (error) {\n        res.status(500).json({ error: error.message });\n    }\n});\n\nUsers who have access to a category automatically get access to its documents through role derivation - no need for separate document permission checks. This endpoint returns only the categories where the user has the list-documents permission, along with a count of documents in each accessible category.\nIntegrating CASL with  permit-fe-sdk\nCASL allows us to enforce granular permissions within our app, ensuring that resources and actions are accessible only to authorized users or roles.\nFor our React frontend, we use permit-fe-sdk to implement permission-based feature toggling. Instead of making individual permission checks, we load all necessary permissions when the app initializes using loadLocalStateBulk. This optimizes performance by reducing the number of API calls to our permission server. Due to role derivation, we only need to check category permissions - document permissions are derived automatically based on the relationship between categories and documents.\n\n// lib/permit.ts\nimport { Permit, permitState } from 'permit-fe-sdk';\n\nexport const getAbility = async (userId: string) => {\n    const permit = Permit({\n        loggedInUser: userId,\n        backendUrl: \"<http://localhost:3001>\"\n    });\n\n    // Only load category permissions since document permissions are derived\n    await permit.loadLocalStateBulk([\n        { action: \"list-documents\", resource: \"Category:finance\" },\n        { action: \"list-documents\", resource: \"Category:hr\" },\n        { action: \"create-document\", resource: \"Category:finance\" },\n        { action: \"create-document\", resource: \"Category:hr\" }\n    ]);\n};\n\nexport { permitState };\n\nNotice how we specify the exact resource instances (e.g., \"Category:finance\") rather than just resource types. This matches our ReBAC model where permissions are based on relationships to specific resource instances.\nConditionally Render the UI using permitState\nIn the Category page, we use permitState.check to verify if the logged-in user has access to list documents in a specific category. With role derivation already set up, we only need to check category-level permissions - the appropriate document permissions are automatically granted to users based on their relationship with the category.\n\n// pages/categories/[categoryId].tsx\n    useEffect(() => {\n        const loadData = async () => {\n            if (!isLoaded || !user || !categoryId || !permissionsLoaded) return;\n\n            const canAccess = permitState?.check(\"list-documents\", `Category:${categoryId}`, {}, {});\n\n            if (!canAccess) {\n                router.push('/');\n                return;\n            }\n\n            setIsLoading(true);\n            try {\n                const docs = await fetchCategoryDocuments(categoryId as string, user.id);\n                setDocuments(docs);\n                setCategoryName(categoryId === 'finance' ? 'Finance' : 'HR');\n            } catch (error) {\n                console.error('Error loading documents:', error);\n            } finally {\n                setIsLoading(false);\n            }\n        };\n\n        loadData();\n    }, [categoryId, isLoaded, user, router, permissionsLoaded]);\n\nWhen a user navigates to a category page, we check their permission before loading any data. They see an error message instead of the documents list if they don't have access. A single category permission check is sufficient - if a user has access to a category, they automatically get the appropriate document permissions through role derivation.\nConclusion\nReBAC with Permit.io provides precise, relationship-based control over feature access in our document management app. Unlike traditional role-based systems, permissions are dynamically determined by the relationships between users and resources - like being an editor of a specific category or viewer of certain documents.\nUsing the permit-fe-sdk, we implemented these complex permission checks with simple, intuitive code. The ability to load permissions in bulk and check them using permitState.check() makes it straightforward to toggle features based on user relationships, without compromising on security or performance.\nThis approach shines in scenarios where access control needs to be granular and dynamic, making it an excellent choice for modern applications where user permissions need to adapt based on context and relationships.\nWant to learn more about implementing authorization? Got questions?\nReach out to us in our Slack community."
  },
  {
    "id": "1f94c1dc-ed5b-80bf-a307-d9a161e14c56",
    "title": "Reading stack traces, logs, metrics - the skill of listening to systems",
    "created_time": "2025-05-20T14:06:00.000Z",
    "last_edited_time": "2025-05-20T14:06:00.000Z",
    "content": "Research\nDraft 1\nDraft 2\n• Outline\n    ◦ Software systems are always emitting signals—stack traces, logs, metrics—but most developers aren’t trained to read them fluently.\n    ◦ Debugging is less about fixing and more about listening. Every error is a message. Every log is context. Every metric is a breadcrumb.\n    ◦ This article explores the skill of reading system signals across JavaScript environments. It covers async stack traces, structured logging, metrics interpretation, and how tools like CodeRabbit fit naturally into this workflow.\nStack traces are where most debugging starts\n    ◦ Explain how stack traces help identify where an error occurred and how to follow the execution trail. Explain the anatomy of a stack trace: function calls, file paths, line numbers.\n    ◦ Compare browser vs Node.js stack traces, and how source maps or transpilation (like Babel or TypeScript) can affect readability.\n    ◦ Discuss how async stack traces can lose context, and how modern tools or runtime options help preserve it.\nLogs are the narrative your code writes\n    ◦ Emphasize the importance of structured and purposeful logging: Why structured logging is critical for large codebases and production systems.\n    ◦ Compare console.log() with libraries like debug, winston, and pino, especially in Node.js and fullstack setups.\n    ◦ Explain how noise in logs can hide real issues. Tools like CodeRabbit can flag overly verbose or missing log statements that impact debuggability.\nMetrics show when something’s wrong before you even see a bug\n    ◦ Introduce metrics as signals of performance or health, not just error indicators. Mention types of metrics every engineer should monitor: counters, gauges, histograms.\n    ◦ Metrics examples for JavaScript apps: memory leaks, event loop blocking, API latency spikes.\n    ◦ Talk about how devs should create internal feedback loops using tools like Prometheus, Datadog, or Vercel Analytics. Setting up internal alerts and early-warning systems with observability tools like Datadog, New Relic, or custom setups.\nDebugging is emotional regulation\n    ◦ Debugging under pressure can lead to hasty fixes and missed root causes. Debugging is a skill of managing complexity, uncertainty, and frustration.\n    ◦ Make the case that systems with clear logs, actionable errors, and solid observability let engineers stay calm and make better decisions.\n    ◦ Tools like CodeRabbit help here by surfacing issues directly in the pull request—before they become runtime problems.\nA debugging-aware dev workflow\n    ◦ Tie the concepts together: start with the error (trace), expand context (logs), validate system state (metrics).\n    ◦ Mention how tools like CodeRabbit, when integrated into CI/CD workflows, help teams spot bad patterns in logs, stack usage, or error handling early.\nWhen systems speak\nProgramming is how we communicate with computers. So far, we have mastered the speaking part: dozens of languages, IDEs, and LLMs that spew boilerplate code in seconds.\nWhat we still struggle with is listening. As we write code, our running systems respond with it’s own language: stack traces, logs, and metrics.\nThis article will show you how to read these signals. You'll also discover how stack traces can reveal the exact source of errors, how structured logs tell the story behind the errors, and how metrics warn you of the errors before they become critical.\nStack traces pinpoint the pain\nA stack trace is the body’s pain signal. It pinpoints the exact line of code that failed and lists every function that called it. Read it top‑to‑bottom and you can walk back to the source of the problem.\nThere are two kinds of stack traces to recognise: browser traces and Node traces.\nBrowser traces label frames with script URLs or bundle names. Minification can hide the real file so you load source maps to translate addresses back to TypeScript.\nNode traces print absolute paths and exact line numbers. Node supports --enable-source-maps so every error maps to original code instead of compiled output.\nFor asynchronous calls, when an error surfaces inside a promise chain, the trace will lose the original caller. Modern Node (v12 and later) and Chrome DevTools will attach async frames if you turn on their async‑trace options. Tools like CodeRabbit catch un‑awaited promises in pull requests and prevents missing frames before code goes to production.\nLogs write the case notes\nIf stack traces show where it hurts, logs record what the patient was doing at the moment of pain. A good log answers three questions: what happened, where it happened, and why it matters. Structured logging delivers that clarity. Libraries such as Pino and Winston prepend timestamps, levels, and JSON fields. A Pino line looks like\n\n{\"level\":30,\"time\":1721402300000,\"msg\":\"List users\",\"page\":1,\"returned\":10}\n\n\nBy contrast, console.log speaks in whispers with no context or structure. It flattens all messages to the same importance, and bury critical signals in verbose output. Structured logging brings order with clear levels: DEBUG for development details, INFO for business operations, and ERROR for critical failures.\nTools like CodeRabbit reviews pull requests and flags empty catch blocks, missing correlation IDs, and overloaded console.log statements.\nWhen CodeRabbit spots silent failures, it suggests specific improvements that add proper logging. These suggested fixes provide structured error details and maintain a clear narrative for any team member investigating the issues later.\nMetrics monitor the vital signs\nWhile logs tells you about past events after they’ve occurred, metrics continuously your software’s health in real time. These metrics acts as warning signals that reveal potential problems before they escalate into incidents that will appear in your logs.\nJust as doctors monitor different aspects of a patient's condition, software exposes three critical indicators:\n• Counters track one-way events like a heart monitor counting beats; they only increase (e.g requests served, errors thrown, transactions completed)\n• Gauges fluctuate like body temperature, rising and falling with changing conditions (e.g memory usage, active connections, queue depth)\n• Histograms reveal distributions like blood pressure readings, showing averages and dangerous outliers (e.g response times, payload sizes, processing durations)\nIn Node.js applications, these three metrics demand your immediate attention:\n1. Heap gauge: memory usage over time. A steady climb signals a leak long before an out‑of‑memory crash.\n2. Event‑loop delay histogram: spikes above 100 ms confirm CPU‑bound code is blocking requests.\n3. Latency histogram for external APIs: heavy tails expose a slowing dependency even when error rate stays flat.\nThe metric above shows a Node.js process reporting its heap usage (about 9MB) in Prometheus format.\n<aside>\n💡\nInstrument these vital signs with prom-client and publish a /metrics endpoint. Scrape with Prometheus or Datadog and alert on rate of change: a heap jump of 25 percent in fifteen minutes demands attention\n</aside>\nDebugging is emotional regulation\nA calm mind turns signals into action while a panicked mind guesses and rewrites random code. Debugging is an art. It’s the art of staying clinical under pressure.\nTo eliminate panic while debugging you need precise stack traces, clear logs and metrics. Together, they replace fear with facts. You shift from asking “What if everything is broken?” to “I see exactly where the system hurts and why.”\nTools like CodeRabbit reduce panic. It empowers the reviewer to block unhandled promises, missing logs, and silent failures before they reach users.\nA debugging‑aware development workflow\nA healthy codebase never hides its symptoms; it reports them up front.\n1. Instrument first: before writing new logic, ask “If this fails, what symptom will I see?”\n2. Review with guardrails: CodeRabbit inspects each pull request for missing logs, silent promise rejections, and untracked metrics.\n3. Deploy and observe: watch dashboards during rollout. Correlate the first error trace with surrounding logs and live metrics; confirm a fix by watching vitals stabilise.\n4. Close the loop: every incident feeds upgrades to instrumentation. If a signal was noisy, tune it. If a metric was missing, add it.\nConclusion\nProgramming is a two-way conversation. We've mastered how to speak to machines through code, but the best engineers also excel at listening to what systems tell them in return.\nStack traces, logs, and metrics form a language that your applications speak continuously. Learning to interpret these signals transforms debugging from chaotic guesswork into methodical diagnosis."
  },
  {
    "id": "1f94c1dc-ed5b-8026-a5da-fe3d0ee478d1",
    "title": "Automated Fine-Grained Permissions and Bulk Messaging Made Simple with Permit.io and Resend",
    "created_time": "2025-05-20T14:05:00.000Z",
    "last_edited_time": "2025-05-20T14:06:00.000Z",
    "content": "\n• Outline\n\n    ◦ Introduction (concise problem/solution overview)\n    ◦ What We'll Build (detailed explanation with real-world scenario)\n    ◦ Prerequisites and Tech Stack\n    ◦ Planning Our Authorization Model\n    ◦ Implementation:\n\n        ▪ Setting up the development environment\n        ▪ Configuring Permit.io resources and permissions\n        ▪ Setting up Resend\n        ▪ Building the notification system\n        ▪ Creating the automation workflow\n    ◦ Testing the Implementation\n    ◦ Conclusion\nProperty management demands consistent communication with tenants about critical events such as move-out dates, maintenance requests, and security deposit information. This communication presents two significant challenges: ensuring only authorized individuals receive sensitive information and automating the notification process to eliminate manual work.\nManual notification systems break down at scale. Sending individualized communications to dozens or hundreds of tenants creates an unsustainable workload for property managers. More critically, distributing sensitive information to unauthorized parties creates serious privacy violations and potential compliance issues. Email services like Resend excel at message delivery but lack the authorization controls necessary for secure tenant communications.\nOur solution combines Permit.io's robust authorization framework with Resend's efficient email delivery system in a NextJS application. This integration automatically identifies upcoming tenant move-out dates, verifies user authorization based on their relationship to the property (tenant or co-signer), and delivers personalized emails containing only the appropriate information for each recipient.\nImplementing relationship-based access control (ReBAC) ensures sensitive information reaches only authorized recipients, while the automation system eliminates manual tracking and communication overhead. This approach scales efficiently across property portfolios of any size while maintaining security and compliance.\nWhat We'll Build\nProperty managers transitioning tenants out of units need precise control over who receives what information. Our system implements this control through a NextJS application that combines authorization logic with automated email delivery. The application validates tenant relationships at the property level, sending different notification types based on established permissions.\nThe heart of our system lies in the distinction between relationship types and content access. Primary tenants receive comprehensive move-out instructions including both procedural checklists and deposit information. Co-signers, who bear financial responsibility but don't occupy the unit, receive only deposit-related communications. This separation happens automatically based on relationship definitions in Permit.io.\nOur application will include:\n• A property management dashboard displaying upcoming move-out dates\n• A relationship-based permission model defining access rights for tenants and co-signers\n• An automated notification system that detects approaching move-out dates\n• Permission-enforced email generation that filters content based on recipient authorization\n• A scheduled task system that runs the notification process without manual intervention\nPrerequisites and Tech Stack\nThis project requires Node.js (v18+) and npm (v10+). You'll also need free accounts with Permit.io and Resend to obtain API keys for authorization and email delivery.\nOur application uses:\n• Next.js with TypeScript\n• Permit.io for authorization\n• Resend for email delivery\n• Docker for running the local Policy Decision Point\n• ShadCN UI for the interface components\nA basic understanding of React and TypeScript will help as we build this permission-driven notification system.\nPlanning Our Authorization Model\nBefore writing code, we need to design our authorization model. This crucial planning step establishes who can access what information in our system. For property management, we'll implement a relationship-based access control (ReBAC) model that focuses on the connections between users and properties.\nOur authorization model centers on a single resource type: Property. Each property instance represents an individual rental unit with its own set of relationships. Rather than applying permissions globally, we'll define them at the instance level, allowing fine-grained control over who receives which notifications for each specific property.\nDIAGRAM 1: Resource model showing Property as the central resource type with its attributes and actions\nTwo key relationship types exist in our model:\n• Tenant: The primary renter who lives in the property\n• Co-Signer: A financially responsible party who doesn't occupy the property\nThese relationships determine what information a user can access. A tenant relationship grants access to both move-out checklists and deposit details. A co-signer relationship grants access only to deposit details, reflecting their financial interest without operational involvement in the property.\nDIAGRAM 2: Relationship flow showing how users connect to properties and what information each relationship type can access\nOur system defines two distinct actions that require permission checks:\n• move-out-checklist: Procedural information for vacating the property\n• deposit-details: Financial information about security deposit handling\nThe permission matrix maps relationships to actions:\n• Tenants can access both move-out-checklist and deposit-details\n• Co-signers can access only deposit-details\nThis model reflects real-world authority structures while protecting sensitive information. When our notification system runs, it performs discrete permission checks for each content type and recipient, ensuring information boundaries remain intact.\nImplementation\nSetting Up the Development Environment\nLet's begin by creating a Next.js application with TypeScript support. This framework provides both frontend and API capabilities within a unified project structure:\n\nnpx create-next-app@latest manage-tenants --typescript\ncd manage-tenants\n\nConfiguring Permit.io Resources and Permissions\nSetting up Permit.io involves defining our authorization model, creating resources, and establishing permissions. Let's walk through this process step by step.\nStep 1: Create a Permit.io Project\nBegin by setting up your workspace in Permit.io:\n1. Create a new workspace for your organization\n2. Within the workspace, create a project called \"Manage Tenants\"\n3. Set up a \"Development\" environment for testing\nStep 2: Define the Property Resource\nNext, configure the Property resource that represents rental units in our system:\n1. Navigate to Policy → Resources in the left sidebar\n2. Click \"Add Resource\" to open the configuration panel\n3. Set the following parameters:\n\n    ◦ Name: Property\n    ◦ Key: property\n    ◦ Actions: move-out-checklist, deposit-details\n    ◦ ReBAC Roles: tenant, co-signer\nStep 3: Configure Permission Policies\nWith our resource defined, set up the permission rules:\n1. Go to the Policy Editor tab\n2. Grant the tenant role access to both deposit-details and move-out-checklist\n3. Grant the co-signer role access only to deposit-details\nStep 4: Install the Permit.io SDK\nInstall the SDK in your Next.js project:\n\nnpm i permitio \n\nStep 5: Get API Credentials\nRetrieve your API key from Permit.io:\n1. Navigate to Settings → API Keys in the dashboard\n2. Create a new API key and copy the secret value\n3. Add it to your environment variables in .env.development.local:\n\nNEXT_PUBLIC_PERMIT_API_KEY=permit_key_xxxxxxxxxxxxx\n\nStep 6: Run the Policy Decision Point (PDP)\nSet up a local PDP for faster authorization decisions:\n1. Create a docker-compose.yml file in your project root:\n\nversion: '3'\nservices:\n  pdp-service:\n    image: permitio/pdp-v2:latest\n    ports:\n      - \"7766:7000\"\n    environment:\n      - PDP_API_KEY=permit_key_xxxxxxxxx\n      - PDP_DEBUG=True\n    stdin_open: true\n    tty: true\n\n2. Start the PDP service:\n\ndocker compose up -d\n\nStep 7: Configure the Permit.io Client\nCreate a client for the SDK in lib/permitio.ts:\n\nimport { Permit } from 'permitio';\n\nconst pdpUrl = process.env.PDP_URL || '<http://localhost:7766>';\nconst apiKey = process.env.NEXT_PUBLIC_PERMIT_API_KEY!;\n\nexport const PERMITIO_SDK = new Permit({\n  token: apiKey,\n  pdp: pdpUrl,\n});\n\nBuilding the Notification System\nThe notification system forms the core of our application, connecting our authorization model to email delivery. This system must determine which users should receive which types of information based on their relationship to each property.\nOur notification logic performs three key operations: identifying properties with approaching move-out dates, checking user permissions for different notification types, and sending authorized messages through Resend. These operations work together to ensure sensitive information reaches only appropriate recipients.\nLet's create the server action that powers this functionality. Start by creating an app/actions.ts file to house our notification logic:\n\n'use server';\n\nimport { PERMITIO_SDK } from '@/lib/permitio';\nimport { RESEND_SDK } from '@/lib/resend';\nimport { properties } from '@/properties';\n\nexport type PermissionType = 'move-out-checklist' | 'deposit-details';\nexport type Property = (typeof properties)[0];\n\nconst defaultAddress = ''; // Your test email for development\n\nWe define types for the permission checks and property data, establishing type safety throughout our application. The defaultAddress variable facilitates testing, as Resend initially limits sending to your verified email.\nNext, we'll implement the permission checking mechanism:\n\nconst checkPermission = async (\n  userKey: string,\n  permissionType: PermissionType,\n  resourceInstance: string\n) => {\n  const permission = await PERMITIO_SDK.check(\n    userKey,\n    permissionType,\n    `property:${resourceInstance}`\n  );\n\n  return permission;\n};\n\nThis function translates our authorization model into concrete permission checks. It queries the Permit.io SDK with three critical pieces of information: the user identifier (email), the action being performed, and the specific property instance. The response determines whether the user has access to that information type.\nWe need a function to identify properties with upcoming move-out dates:\n\nconst checkProperties = async () => {\n  const properties = await getProperties();\n  const today = new Date();\n  const propertiesToNotify = [];\n\n  for (const property of properties) {\n    const moveOutDate = new Date(property.moveOutDate);\n    const timeDiff = moveOutDate.getTime() - today.getTime();\n    const dayDiff = timeDiff / (1000 * 3600 * 24);\n\n    if (dayDiff < 1 && dayDiff >= 0) {\n      propertiesToNotify.push(property);\n    }\n  }\n\n  return propertiesToNotify;\n};\n\nThis function calculates the time difference between today and each property's move-out date, identifying those within 24 hours. These properties trigger notifications to their associated users.\nThe core notification logic resides in the notifyUser function:\n\nconst notifyUser = async (\n  property: Property,\n  user: Property['coSigner'] | Property['tenant']\n) => {\n  // Email templates\n  const moveOutChecklistTemplate = `\n    <h1>Move Out Checklist</h1>\n    <p>Dear ${user.name},</p>\n    <p>Please complete the move-out checklist for the property\n      <strong>${property.propertyName}</strong> before\n      <strong>${property.moveOutDate}</strong>.\n    </p>\n    <p>Thank you.</p>\n  `;\n\n  const depositDetailsTemplate = `\n    <h1>Deposit Details</h1>\n    <p>Dear ${user.name},</p>\n    <p>Here are the deposit details for the property\n      <strong>${property.propertyName}</strong>.\n    </p>\n    <p>Thank you.</p>\n  `;\n\n  // Permission checks for each notification type\n  const hasMoveOutCheckListPermission = await checkPermission(\n    user.email,\n    'move-out-checklist',\n    property.propertyKey\n  );\n\n  const hasDepositDetailsPermission = await checkPermission(\n    user.email,\n    'deposit-details',\n    property.propertyKey\n  );\n\n  // Build emails based on permissions\n  const emails = [];\n\n  if (hasMoveOutCheckListPermission) {\n    emails.push({\n      from: 'Manage Tenants <onboarding@resend.dev>',\n      to: defaultAddress || user.email,\n      subject: `Move Out Checklist for ${property.propertyName}`,\n      html: moveOutChecklistTemplate,\n    });\n  }\n\n  if (hasDepositDetailsPermission) {\n    emails.push({\n      from: 'Manage Tenants <onboarding@resend.dev>',\n      to: defaultAddress || user.email,\n      subject: `Deposit Details for ${property.propertyName}`,\n      html: depositDetailsTemplate,\n    });\n  }\n\n  // Send emails in a batch\n  if (emails.length) {\n    const { data, error } = await RESEND_SDK.batch.send(emails);\n\n    if (error) {\n      console.error(error);\n    } else {\n      console.log('Emails sent:', data);\n    }\n  }\n};\n\nThe permission checks happen before email composition. This ensures that unauthorized content never enters the message generation pipeline. This approach implements security at the content creation level rather than merely filtering messages afterward.\nFinally, we export the main notification function that orchestrates the entire process:\n\nexport const notifyPropertyUsers = async () => {\n  const properties = await checkProperties();\n\n  for await (const property of properties) {\n    await notifyUser(property, property.tenant);\n    setTimeout(async () => {\n      await notifyUser(property, property.coSigner);\n    }, 2000);\n  }\n};\n\nThis function retrieves properties with upcoming move-out dates and triggers the notification process for each tenant and co-signer. The staggered sending using setTimeout prevents rate limiting issues with the email service. The batch sending approach improves efficiency by grouping authorized notifications into a single API call.\nCreating the Automation Workflow\nThe final component of our system automates the notification process. Manual monitoring of move-out dates wastes valuable time and introduces human error risks. Our automation workflow uses scheduled tasks to identify properties with approaching move-out dates and trigger appropriate notifications without human intervention.\nFirst, we need the node-cron package to handle scheduling:\n\nnpm i node-cron\nnpm i -D @types/node-cron\n\nNode-cron provides pattern-based scheduling similar to Unix cron jobs, enabling precise control over when our notifications run. The scheduler supports various time patterns, allowing flexibility from minute-by-minute execution to specific days of the month.\nNext, we'll create an API endpoint that triggers the notification task. This endpoint serves two purposes: starting the scheduled task when the application launches and providing a manual trigger for testing. Create app/api/cron/route.ts with the following implementation:\n\nimport { notifyPropertyUsers } from '@/app/actions';\nimport { NextResponse } from 'next/server';\nimport cron from 'node-cron';\n\nexport async function GET() {\n  cron.schedule(\n    '*/30 * * * *',  // Runs every 30 minutes\n    async () => {\n      await notifyPropertyUsers();\n    },\n    {\n      name: 'notifyPropertyUsers',\n    }\n  );\n\n  return NextResponse.json({\n    message: 'Cron job started',\n  });\n}\n\nThe cron pattern */30 * * * * executes the task every 30 minutes. In production, you would adjust this pattern to match your notification requirements—perhaps once daily at midnight (0 0 * * *) for move-out reminders.\nOur automation flow works through several stages:\n1. The scheduler triggers the notifyPropertyUsers function based on the cron pattern. Thereby, monitoring upcoming move-out dates across the property portfolio\n2. The function identifies properties with move-out dates in the next 24 hours. Thus, determining which notifications each user should receive\n3. For each property, the system checks permission-based access for both tenants and co-signers. As a result, composing and sending individual emails to each recipient\n4. Authorized notifications generate and send automatically through Resend. Hence, enabling tracking which notifications have been sent.\nTo test the automation, update the app/page.tsx file to include a trigger button:\n\ntarget=\"_blank\"\n  href=\"/api/cron\"\n  className=\"bg-white text-blue-600 py-2 px-4 rounded hover:bg-gray-200 transition duration-300\"\n>\n  Trigger Automation\n</a>\n\nClicking this button manually activates the cron job, making it easier to test the notification flow during development. The system starts monitoring for properties with upcoming move-out dates and sends appropriately permissioned notifications to tenants and co-signers.\nFor production deployments, this basic cron implementation should be replaced with a more robust scheduling system like AWS EventBridge, Google Cloud Scheduler, or a dedicated service like Temporal. These systems provide better reliability, monitoring, and error handling for mission-critical workflows.\nThe automation system completes our application by turning manual notification processes into an autonomous workflow driven by our permission model. Property managers now focus on handling exceptions rather than routine communications, dramatically improving operational efficiency.\nTesting the Implementation\nWith our system completed, it's time to verify that everything works correctly. Navigate to http://localhost:3000 to access the property management dashboard. You should see our interface with the options to view properties and trigger the notification automation.\nTo test the system, first ensure your Permit.io directory contains properly configured users with the correct relationships to property instances. Then click the \"Trigger Automation\" button to start the notification process. The system will:\n1. Identify properties with move-out dates in the next 24 hours\n2. Check permissions for each tenant and co-signer\n3. Send appropriate emails based on their relationship to the property\nWhen the automation completes, check your test email account. Tenants receive both notification types - move-out checklists and deposit details:\nCo-signers receive only the deposit details email, demonstrating that our permission model successfully filters content based on user relationships. If any issues occur, check the console logs for permission check results and email delivery status.\nThis testing confirms our implementation successfully combines authorization checks with automated notifications, delivering the right information to the right recipients based on their property relationships.\nConclusion\nWe've successfully built a property management system that solves two critical challenges: ensuring sensitive information reaches only authorized recipients and automating tedious notification workflows. The integration of Permit.io and Resend creates a solution that respects information boundaries while eliminating manual communication overhead.\nOur implementation demonstrates relationship-based access (ReBAC) control in action. This is done by modeling real-world connections between people and properties and as a result, we create a permission system that naturally reflects business reality. Tenants receive comprehensive move-out information while co-signers access only the financial details relevant to their responsibility. This granular control protects sensitive information without sacrificing operational efficiency.\nThe automation layer transforms what would be a time-consuming manual process into a self-running system. Property managers no longer track upcoming move-outs, determine who needs which information, or compose individual emails. The system handles these tasks autonomously while maintaining strict information boundaries. This architecture pattern extends beyond property management to any domain requiring relationship-based permissions and targeted communications. Healthcare providers could use similar systems for patient notifications, ensuring family members receive only appropriate medical information. Financial institutions might implement it for account alerts, with different stakeholders receiving information based on their account relationships.\nFor further exploration, consider extending this system with:\n• More sophisticated email templates using React components in Resend\n• Additional notification channels like SMS through third-party services\n• More complex relationship types that reflect additional business roles\nThe complete source code for this implementation is available on GitHub. For more information on the technologies used, visit:\n• Permit.io Documentation\n• Resend Documentation\n• Next.js Documentation"
  },
  {
    "id": "1f94c1dc-ed5b-8037-8c39-ef0def0e4372",
    "title": "Git, diffs, patches — thinking in changes, not just code",
    "created_time": "2025-05-20T14:05:00.000Z",
    "last_edited_time": "2025-05-20T14:05:00.000Z",
    "content": "Orchestrating deliberate and meaningful changes to software systems continually is one of the core features of a good software development process. When collaborating in teams, changes are the language of communication, theoretically at least. In practice, changes are defined by reading diffs (differences) rather than entire files. Think about it, when reviewing a pull request in GitHub, your eyes are focused on the red and green lines which represents the additions and deletions within the context of the unchanged code.\nThis article is proposing a different approach when working with changes. The goal is to convince you that adopting a change-focused way of thinking will impact the way you review, debug, and merge code. You’ll also learn about how to think in patches as a mental model and the anatomy of diffs. Simplifying complexity is a very essential skill, thus we’ll discuss atomic commits as units of intent and practical techniques for crafting reviewable changes and organizing intentional pull requests.\nHow to think about code changes as patches\nHave you ever used a patch tape to cover a specific wounded area of your body? this is how you should think of changes. When you’re fixing a bug or working on a feature branch, your changes are patches. In this case, you can describe patches as small, focused, self-contained modifications that tell a complete story on their own. A very important characteristic of patches is that they don't try to fix everything at once or mix unrelated concerns. The idea is to create that boundary between “after” and “before” states.\nA patch-focused approach is not just about commits. It should be incorporated as a way of communicating clearly. Let’s dive deeper by referencing the Linux kernel development team approach on this approach. The kernel developer style guide recommends that each patch needs to be a self-contained logical whole. If your description starts to get long, that's a sign you probably need to split up your patch. This is because the maintainers receive thousands of patches and following this practice,  enables them to evaluate changes efficiently across a globally distributed team.\nThe idea you should pick from this section is that when you write changes, write it as if you won’t be there to explain them. This way others can work with your code faster, and with fewer questions.\n<aside>\n💡\nRun git show HEAD to view the most recent commit as a patch, complete with metadata, commit message, and the diff of changes. This helps develop a patch-oriented mindset.\n</aside>\nMake every commit an atomic unit of intent\nAn atom is the smallest amount of anything. In our context, an atomic commit abstracts a single, indivisible change that accomplishes a single purpose. One developer said that working with atomic git commits means your commits are of the smallest possible size. Each commit does one, and only one simple thing, that can be summed up in a simple sentence.\nFollowing this approach means that when something in code breaks, you can easily identify and revert problematic changes without undoing unrelated work. One git tool that helps you achieve this is git bisect. This tool performs a binary search through commit history to find where a bug was introduced. When bisect identifies a specific commit as the source of a problem, an atomic approach means you'll immediately understand the precise scope of what went wrong.\nHow to make atomic commits\nLet’s illustrate this practically using the expressjs code repo. If you run git log --oneline you’ll see the last 5 commits.\nWith git bisect if there’s a bad commit you want to fix, it will walk through your commit tree and pinpoint the exact change that introduced the issue.\nThis is the exact change that caused the issue, isolated in one atomic commit.\nNotice how easy it was to pick this out? that’s the power of atomic commits.\nHowever, achieving this level of discipline will require some adjustments to your git workflow. So, instead of committing all changes at once, we recommend using git add -p (interactive patch staging) to select specific chunks for each focused commit.\nWith this workflow, when you catch a bug or minor mistake, you don’t have to pollute your commit history with unrelated changes. Just use --fixup + rebase -i --autosquash to preserve that narrative clarity.\nYou can think of this as climbing a staircase. You can’t see the top of—you focus on the next step, complete it, and commit. While it can feel like extra work initially, but the clarity and control it provides quickly becomes indispensable at the end.\nSo far, you’ve learned how to think like a patch and how to implement an atomic-commit based workflow to making changes. Now let’s talk about diffs.\nWhat makes a git diff meaningful and easy to review\nIn Git, diff is a tool used  to show the differences between various commits, branches, or files. It’s core feature is to inspect changes in your codebase, which allows you to see what has been added, modified, or deleted. However not all diffs are meaningful. A diff is meaningful if it has these characteristics:\n• It addresses a single concern\n• It's appropriately sized—not too large, not overly granular\n• It excludes unrelated noise like formatting or whitespace changes\nThis means, when a reviewer is going through your code changes, they should be able to quickly grasp what’s changing and why without any filtering. Noisy, unfocused diffs are costly because:\n• They slow down code review by forcing reviewers to untangle mixed concerns.\n• They increase the risk of merge conflicts by unnecessarily touching many files or lines.\n• Most importantly, they hide functional changes, thereby making bugs harder to spot.\nThat’s we recommend self-reviews. This means that before opening a pull request, inspect your changes using git diff or your IDE’s comparison view. Ask:\n• “Does this diff clearly express my intent?”\n• “Did I include anything accidental?”\n• “Should I split this into smaller, more logical commits?”\nThe mental model you should adopt towards diffs is that you’re contributing a clear, intentional change that makes your codebase easier for others to work with. Why does this even matter?\nWhy Thinking in Diffs Scales Better for Growing Teams\nIn a small team of 1 - 3 engineers, just atomic commits are enough cause it’s easier to track and fix your own mistakes. But once you have 8 or more developers working in the same codebase, pull requests start piling up, merge conflicts increase, and the backlog of complex, unfocused changes for reviewers becomes unmanageable. This is where a diff-centric workflow can save lives.\nThe biggest gains of meaningful diffs show up in code review and debugging. Most notably, merge conflicts happen less often because atomic commits reduce the \"collision surface\" where changes overlap. Bugs are easier to track down, since git bisect can isolate the exact change that introduced an issue.\nFurthermore, onboarding becomes faster—new team members can follow the project’s evolution step by step, rather than getting lost in scattered or oversized changes. A clean commit history becomes a map, not a mess. When you’ve created meaningful diffs with atomic commits, you’ve completed 80% of the work. The other 20% is in creating pull requests that are clear and intent focused.\nHow to write clear, intent-focused pull requests\nSo what does “intent-focused PRs” mean in this context? An intent-focused PR applies the philosophy of make one cohesive change, but at a higher level. The PR should focus on a single feature, bug fix, or improvement, and communicate that clearly to the reviewers.\nSmaller PRs are easier to review and less likely to block your team. Most engineering teams aim for under 200 lines of change—and ideally around 50. At that size, you can understand the full picture without jumping between files or guessing the author’s intent. And it’s not just humans who benefit from that clarity. CodeRabbit, an AI-powered reviewer, performs way better on focused, well-scoped PRs. The AI can catch real issues faster when the diff is clean and tight—because it’s not wading through a hundred unrelated edits to find what matters\nHere’s a good example from the React repo: facebook/react#32819. This PR starts with a clear title and detailed description of intent\nYou can also see clean atomic commits:\nMeaningful diffs also make it easy to create focused discussions like this:\nThis is how a well-scoped PR should look like. The diff is readable, and the reviews are fast.\n6 rules for writing pull requests that get reviewed fast\nHere are six checklist items you should always keep in mind when making PRs\n1. State what changed and why: The PR title and description should clearly explain both the change and the reason behind it.\n2. Keep your feature branches focused on one purpose: Use a dedicated feature or bugfix branch for each task.\n3. Don’t let unrelated changes accumulate: Avoid including refactors, formatting, or cleanup unless directly tied to the change.\n4. If scope creep happens during review (say you find another bug), spin that off into a separate PR.\n5. Review your own diff before pushing: Always check your PR diff before assigning reviewers.\n6. Keep PRs reasonably sized: Aim to stay under 200 lines of change whenever possible.\nWhy thinking in changes makes you a better developer\nShifting from thinking in code to thinking in changes is a way of reframing your developer workflow as a process of small, intentional improvements. This mindset shapes how you use Git, structure commits, write pull requests, and review each other’s work. Focused diffs, atomic commits, and purpose-driven PRs create cleaner history, speed up reviews, and make codebases easier to understand.\nBefore you commit or open a pull request, pause and look at the diff. Ask yourself: “Does this change stand on its own? Will another developer understand my intent from this alone?” When the answer is yes, you’re not just pushing code—you’re contributing a clear, intentional change that makes your codebase easier to work with. That’s the real work of software development."
  }
]